[{"title":"谈痛苦","date":"2017-03-22T14:26:50.000Z","path":"2017/03/22/谈痛苦/","text":"写在前面这是本博客第一篇人文方向的散文。 实际上我早就想写一写这方面的东西了，但总是写不下去，因为写的片段实在无法令自己满意，说白了其实自己也没想透彻。另一方面是因为自己没有花精力做研究，能写的也大多是基于个人经验的东西，颇有些闭门造车的意思，有极大的局限性。 可如果总是这样畏首畏尾下去，恐怕连自己脑子里的半吊子想法也都消磨于时间的河流了。因此决定还是把自己的想法表达出来，哪怕千疮百孔。还望读者海涵。 引言快乐和痛苦始终是我非常关注的一个话题。往浅了说，是想让自己从生活中Hack出更多的快乐。往深了说，广义的快乐与痛苦也就成了效用（Utility），是功利主义（Utilitarianism）的核心。就算我不是这个主义的簇拥者，“效用”这个概念也是非常深刻的、值得研究的。 正文基督教认为，人是有原罪的。我不信教，但仍认为人这一生从总体上看，痛苦大于快乐。或者换一种很玄的说法，就是众生皆苦。 从人类的经验来说，“人生苦短”也几乎是所有人公认的事情。而钱钟书也在《论快乐》一文中以他深厚的文学底蕴阐释了这一点。 在旧书铺里买回来维尼(Vigny)的《诗人日记》(Journald’unpote)， 信手翻开，就看见有趣的一条。他说，在法语里，喜乐(bonheur)一个名 词是“好”和“钟点”两字拼成，可见好事多磨，只是个把钟头的玩意儿 (Silebon heurn’taitqu’unebonnedenie!)。我们联想到我们本国话的说法，也同样的意味深永，譬如快活或快乐的快字，就把人生一切乐事的 飘瞥难留，极清楚地指示出来。所以我们又概叹说：“欢娱嫌夜短！”因为人在高兴的时候，活得太快，一到困苦无聊，愈觉得日脚像跛了似的，走得特别慢。德语的沉闷（langweile）一词，据字面上直译，就是“长时间”的意思。《西游记》里小猴子对孙行者说:“天上一日，下界一年。”这种神话，确反映着人类的心理。天上比人间舒服欢乐，所以神仙活得快，人间一年在天上只当一日过。从此类推，地狱里比人间更痛苦，日子一定愈加难度；段成式《西阳杂俎》就说：“鬼言三年，人间三日。”嫌人生短促的人，真是最快活的人；反过来说，真快活的人，不管活到多少岁死，只能算是短命夭折。所以，做神仙也并不值得，在凡间已经三十年做了一世的人，在天上还是个未满月的小孩。但是这种“天算”，也有占便宜的地方：譬如戴君孚《广异记》载崔参军捉狐妖，“以桃枝决五下”，长孙无忌说罚得太轻，崔答：“五下是人间五百下，殊非小刑。”可见卖老祝寿等等，在地上最为相宜，而刑罚呢，应该到天上去受。 “永远快乐”这句话，不但渺茫得不能实现，并且荒谬得不能成立。快过的决不会永久；我们说永远快乐，正好像说四方的圆形，静止的动作同样地自相矛盾。在高兴的时候，我们空对瞬息即逝的时间喊着说：“逗留一会儿罢！你太美了！”那有什么用？你要永久，你该向痛苦里去找。不讲别的，只要一个失眠的晚上，或者有约不来的下午，或者一课沉闷的听讲——这许多，比一切宗教信仰更有效力，能使你尝到什么叫做“永生”的滋味。人生的刺，就在这里，留恋着不肯快走的，偏是你所不留恋的东西。 然而，为什么痛苦就总是多于快乐？而当我们谈论快乐的时候到底是在说些什么呢？ 为了回答第一个问题，我想先从演化心理学的角度讲。我始终认为演化，是人的心理的唯一决定性因素（尽管不是心理学的唯一研究方法），而现代文明诞生之前的那部分演化，由于其淘汰率远高于之后，更是对心理的塑造至关重要。我对演化的理解是：我们所有的心理之所以存在，完全是因为被“保留”了下来。这种被保留或许是通过增强了载体——人的生存几率，或许是因为它本身存在的概率就大，等等。 从这一点看，我认为“快乐”并不是演化的条件或工具，痛苦才是。自然选择需要的是你遭受危害时的痛苦，预见危害时的恐惧，进而释放肾上腺素，提高生存能力。你快不快乐，谁在乎啊？而且快乐这东西这么复杂（试着说说什么是痛苦/快乐，看看哪种简单），产生这样一种东西并让它保留下来真的很难啊。 你或许要说，为什么演化就不能通过快乐进行？因为演化不是基于激励，而是基于淘汰的啊。“趋利避害”，虽然避害在后头，但它才是更重要的。 从另一个角度讲，很多快乐是需要建立、维护的，而痛苦可能只源于否定、破坏。而确立一个东西比消解它要难太多了，认真做事比直接否定它的意义难多了。西方总有一种“悲剧精神”，他们的各种价值观、主义，也都贯彻着一种沉重，因为建立一套价值体系太难了，而且必然充斥着矛盾，让人有种无法把握的感觉。而为什么怀疑论、神秘主义、虚无主义这么火，让人津津乐道？因为他们急于否定这个世界表层的价值体系（比如善变而矛盾的道德观），却没有建立一套完整的价值体系的能力。这建立和否定的难度悬殊，我认为也是快乐普遍多于痛苦的原因。 然而得出这样一个结论之后我们仍要警惕——是否将快乐的定义过于窄化了，而将痛苦的定义过于泛化了呢？而这不正是辩论者常用的诡辩之术么？ 是了，其实说到这里是有一个问题没有解决的，那就是快乐的含义是什么？ 有人说没有病痛是一种快乐，得到一个想要的东西是一种快乐。但这种快乐的定义本质上是建立在对痛苦的否定上的。比如上述两种快乐其实是对病痛的否定，对渴望带来的焦灼的否定。或许你会说，我得到一个想要的东西完全是“得到”带来的满足感，怎么就非得扯到对XXX的否定呢？但你得到一件东西带来的快乐的量，难道不正是和未得到时的渴望、焦灼相关联的吗？我认为，所有炽热的情感最终都必须和负面情绪关联，而这一点其实也是前面的演化心理学角度所揭示的。 而如果将快乐定义为痛苦的消除，那么它自然就不可能击败痛苦了。很简单的逻辑，快乐由消解痛苦产生且无法自发产生，而痛苦并不总能被消解。故快乐&lt;痛苦。 到此为止我们注意到，快乐小于痛苦，其实是因为快乐难以被定义导致的。 那么我对快乐的定义为，快乐是对“被对象化了的痛苦”的否定。本质上，快乐不存在。 这里要跑个题提醒一下。将某个概念、词汇的意义深究下去，寻找其常规用法背后揭示的本质内核，广义化之后，请务必记住要维护这个词的相关概念的一致性。比如如果承认痛苦永远大于快乐，那人生岂不是非常痛苦，永远无法得到解脱，不如死了算了？其实并没有，因为快乐和痛苦的内涵变了，之前认为的“根本无法忍受痛苦永远比快乐多的人生”也就不凑效了。 为了解释这句话，还是要继续谈痛苦。 高中的时候，有个喜欢玩黑色幽默的同学跟我说，咱们天天在这刷题复习高考，其实都是受虐狂。其实想想是这样，但是，又如何呢？活不下去了么，天天都很烦很难受了么？也没有。 其实，人对痛苦，常常和对恐惧是同一个态度。就是容易把它们抽象、对象化，把它们化为对环境的全面否定了，把它们化为对自身力量的全面否定了。 最近在知乎看到一篇文章。主人公在一个心理学工作坊对治疗师诉说了自己遇到的问题，并作了一番“精神分析”式的自我报告，找了一番原生家庭的问题。而治疗师只有一句话，“你当然可以控制自己，只要你想，并没有一支枪在那里抵着你。Next one.” 前两天高宁老师的课提到马克思理解的解放的三个层次，宗教解放-&gt;政治解放-&gt;人的解放。我总结起来其实就是对“对象化”的批判。人将无力感、力量对象化为神；将人际关系“对象化”为种种公共关系。最终则是失去了对事物本身的认知，被本是自身的一部分的、现在却变质了的东西支配、异化。马克思主义批判的就是这种东西。（至于去私有化，我不是很认同，感觉不是这个思想体系必然推导出的东西。但我不了解马哲，再看看吧） 再回到本文，我想说的就是，痛苦被高估了。尤其是对力量不足、自信心不足的年轻人来说，更是如此。不是说你遭受的痛苦不值一提，相反，作为一个不自信的年轻人，我深深地认为这些痛苦对个人来说就是非常刻骨铭心的。我想说的是，不要对象化痛苦，不要否定环境和自己。 因此上面说的快乐不存在的理由其实是，痛苦被高估了，对象化了。而快乐不是被定义为人感受的痛苦的反面，而是被定义为这种被对象化了的概念的反面。因此若承认这种对象化是不合理的，作为其概念的反面，快乐也就不存在了。这就是我理解的，活在当下。 回到现实随便说几点吧： 在生活中我感受到了两种向上的人的范式：一种是人生顺风顺水、别人家的孩子型，一种是奋起直追、凤凰男型。（自然，少有人处于极端，而大多是二者的调和）我认为这种奋起直追型的人更容易过分看重自己的痛苦，而这也正是这个社会上时不时就会出现一个奇葩大学生的根本原因。 至于我对复仇、宽恕的看法，也就不言而喻了。 有时候会见到的“你没有经历过我的痛苦，凭什么享受相应的快乐”潜台词，还是格局太小。 对自己痛苦的过分重视也是社会戾气的主要来源。 后记其实在写这篇文章的时候，发现很多点都可以说开去。比如为什么我如此看重演化心理学，演化到底是什么意思？比如我们如何对待自己在演化中习得的天性？比如在我们创造一个概念的时候到底意味着什么，贴标签又是什么意思？ 慢慢聊吧。","tags":[{"name":"论述类散文","slug":"论述类散文","permalink":"https://aur3l14no.github.io/tags/论述类散文/"}]},{"title":"SS多用户管理踩坑记录","date":"2017-03-19T04:12:59.000Z","path":"2017/03/19/SS多用户管理踩坑记录/","text":"SS多用户管理的踩坑记录花了8h折腾ss多用户管理 QAQ 一、方案选择Shadowsocks版本 Python libev Go Fast Open Y Y N Multiple Users Y Y Y Management API Y Y N Workers Y N N Graceful Restart Y N N ss-redir N Y N ss-tunnel N Y N UDP Relay Y Y N OTA Y Y Y 这里最值得注意的是哪个Mangagement API，虽然它不是多用户管理所必须的feature，但我采用的方案是基于它的。顺便提一下ShadowsocksR，它的混淆算法据说很厉害，能给用户提供更稳定的网络连接，但因为相关管理工具不多故放弃了。 管理方案 iptables 基于Linux自带的iptables撸一个脚本出来检测 ss-bash shadowsocks修改版 + front-end ss-manyuser + ss-panel shadowsocks的api + front-end managerAPI + shadowsocks-manager 那么实际试下来结果如何呢？ iptables自己写略麻烦，而且缺（不）少（能）UI界（装）面（逼）。ss-bash看上去倒是很不错，可惜最后一次commit是2 year ago，我就没用，有兴趣的朋友可以试试，感觉蛮轻量级的。 修改shadowsocks耦合性太大，ss-panel也比较笨重，要上lnmp，还要进行一堆配置，我又不是商业化的，遂放弃。 用API配合shadowsocks-manager倒上去不错，关键是这个项目目前仍处于活跃状态，而且ss-manager居然跟shadowsocks隶属同一个github user？诶，亲儿子？于是果断采取了这个方案。 二、部署嗯，层层筛选找了这么个看似完美的解决方案是不是就一帆风顺了呢？呵呵。 Shadowsocks版本方面出了问题—— ss-go不支持managerAPI ss-python的流量统计不精确，并且监听流量的配置与ipv4+ipv6并存的配置存在冲突 不同版本的ss配置居然也有细微差别，比如要想支持ipv4+ipv6并存，go的server栏随便填就好，python需要填写server=”::”，libev需要填写[“::0”,”0.0.0.0”]，而且python版不能使用-d start运行，否则就只能监听ipv6了。我也很绝望啊.jpg 由于上述原因，我也就顺其自然地选择了python-libev。于是开始了，最后一次的部署… 三、后记写这篇文章的时候，我真的以为一切都解决了，这部分本来是要写一写详细步骤的。可是用了一段时间后才发现，ss-manager居然导致我的ss每一分钟就要崩溃一会儿，目测是ipv6和ss-manager不兼容。我的内心毫无波动.jpg被坑了那么多回之后呢，我决定自己撸一个出来。所以下回见吧！ 三、详细步骤其实也不是多详细，提供个指南吧，细节请google。 租VPS，推荐Vultr和Ramnode，一个2刀/MO稳定快速一个3刀/MO流量大。至于放aff这种事情就不搞了。 安装BBR，推荐直接使用秋水逸冰的脚本。 安装shadowsocks-libev 如果你的系统版本为Debian8+/Ubuntu14.04+，请使用官网推荐的安装方法。 否则，仍然推荐使用秋水逸冰的脚本，如果采用后者，请在安装完成后执行 update-rc.d -f shadowsocks remove /etc/init.d/shadowsocks stop 来删除开机自启和停止服务，因为我们的启动方式是比较特殊的 安装shadowsocks-manager 请参考github上的安装说明 https://github.com/shadowsocks/shadowsocks-manager 其中开启ss-manager这部分，如果需要ipv4+ipv6并存，使用新建配置文件xxx.json 1234&#123; &quot;server&quot;:[&quot;::0&quot;,&quot;0.0.0.0&quot;], &quot;method&quot;:&quot;aes-256-cfb&quot;&#125; 并用ss-manager -c xxx.json –manager-address 127.0.0.1:6001的方式运行 启动ssmgr的webgui 这部分比较麻烦，请参考Webgui的README Ps. 如果不需要GUI的话也可以直接使用CLI提供的命令行进行流量监控，请参考CLI的README","tags":[{"name":"科学上网","slug":"科学上网","permalink":"https://aur3l14no.github.io/tags/科学上网/"}]},{"title":"不确定世界的理性选择 - MAP","date":"2017-03-13T15:05:14.000Z","path":"2017/03/13/不确定世界的理性选择-MAP/","text":"《不确定世界的理性选择——决策心理学》主要论述了人脑的快与慢两种思维模式在决策时表现出的诸多特性。","tags":[{"name":"阅读","slug":"阅读","permalink":"https://aur3l14no.github.io/tags/阅读/"},{"name":"心理学","slug":"心理学","permalink":"https://aur3l14no.github.io/tags/心理学/"}]},{"title":"词以类计 - Toefl篇 0.1","date":"2017-03-13T13:45:39.000Z","path":"2017/03/13/词以类计-Toefl篇-0-1/","text":"在背《45天突破版 TOEFL词汇 词根+联想记忆法》时整理的一些词，非常partial，且不包含具体解释与对比。 标点符号http://www.360doc.com/content/12/1222/01/7775902_255592329.shtml 睡眠dormancy n.hibernation n.hypnotize v. 解剖/人体相关glandcartilagepancreastendon 船vesselraftcanoebargeclipper 特别高大上的词electicismposthumous 地理hinterlandpeninsulatablelandplateaubasinprairie 制定法律规则、授权stipulateaccreditentitledictateenactcharterlegislate v.legislative a.legislature n.legitimate a. 议会等senateparliamentcongress 物理性质pliablestraintension 树sequoiaelmbarkwillowarboreal 油petroleumgasolinekerosene 重要的substantivesubstantialpredominantdominant 突出的salientprominenteminentpreeminentimminent 宗教monasterycathedralchapel 煽动instigate v.provoke v.foment v. (bad)subversive a. 动作tughurl 繁殖*proliferatepropogatereproduce 纺织品yarnlinenfabric 阻碍inhibit = hinder = impede &gt; hamperstunt: check growth ofthwart: 挫败阻挠 促进facilitatepromptpromote 称赞acclaimextol 尖锐、敏锐astuteacutekeenacumen n.","tags":[{"name":"英语","slug":"英语","permalink":"https://aur3l14no.github.io/tags/英语/"},{"name":"学习","slug":"学习","permalink":"https://aur3l14no.github.io/tags/学习/"}]},{"title":"Can You Hear Me","date":"2017-03-12T16:00:00.000Z","path":"2017/03/13/Can-You-Hear-Me/","text":"欢迎来到我的博客，内容若非注明皆为原创。这篇文章的题目，特取自Person Of Interest中The Machine出生后的第一句话。谢谢支持。","tags":[]}]